Dpaop             s              1    inz('r')           
Dpaclie           s              8  0 inz(95000003)      
Dpaname           s             30a   inz('Gaby3Updated')
C                   call      'TRCLCRUD'                 
C                   parm                    paop         
C                   parm                    paclie       
C                   parm                    paname       
C                   eval      *inlr = *on 
C*2020/11/05 